code-review/NRB_3471_3546/База_Было/InformationRegisters/АдресныйКлассификатор.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>АдресныйКлассификатор</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Наименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>52</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сокращение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Индекс</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>6</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АльтернативныеНазвания</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ТипАдресногоЭлемента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КодРегионаВКоде</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КодРайонаВКоде</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КодГородаВКоде</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КодНаселенногоПунктаВКоде</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КодУлицыВКоде</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Код</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>25</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

code-review/NRB_3471_3546/База_Было/Catalogs/АдресныеСокращения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>АдресныеСокращения</Name>
			<Comment>(Общ)</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Уровень</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сокращение</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

code-review/NRB_3471_3546/База_Было/InformationRegisters/АдресныйКлассификатор/Ext/ManagerModule.bsl
Функция ПолучитьПутьФайлаКлассификатора(ДанныеФайла)
	
	ПутьКФайлу = "";
	Если ДанныеФайла <> Неопределено Тогда 
		ПутьКФайлу = КаталогВременныхФайлов() + ДанныеФайла.ИмяФайла;
		ДанныеФайла.ДанныеФайла.Записать(ПутьКФайлу);
		Файл = Новый Файл(ПутьКФайлу);
	КонецЕсли;	
	
	Возврат ПутьКФайлу;
	
КонецФункции

Процедура УстановитьКодировку(ФайлБД, КодировкаWindows)
	
	Если КодировкаWindows Тогда
		ФайлБД.Кодировка = КодировкаXBase.ANSI;
	Иначе
		ФайлБД.Кодировка = КодировкаXBase.OEM;
	КонецЕсли;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////////////////////////////////

Процедура ДополнитьПараметрыЗагрузки(ПараметрыОперации)	
	
	//ИспользованныеКоды = Новый Соответствие();	
	
	//АльтернативныеНазвания  = Новый ТаблицаЗначений();
	//АльтернативныеНазвания.Колонки.Добавить("Код");
	//АльтернативныеНазвания.Колонки.Добавить("Наименование");
	//АльтернативныеНазвания.Колонки.Добавить("Сокращение");
	
	//АдресныеСведения = Новый ТаблицаЗначений();
	//АдресныеСведения.Колонки.Добавить("Код");
	//АдресныеСведения.Колонки.Добавить("КодРегионаВКоде");
	//АдресныеСведения.Колонки.Добавить("Наименование");
	//АдресныеСведения.Колонки.Добавить("АльтернативныеНазвания");
	//АдресныеСведения.Колонки.Добавить("Сокращение");
	//АдресныеСведения.Колонки.Добавить("Индекс");
	//АдресныеСведения.Колонки.Добавить("ТипАдресногоЭлемента");
	//АдресныеСведения.Колонки.Добавить("КодРайонаВКоде");
	//АдресныеСведения.Колонки.Добавить("КодГородаВКоде");
	//АдресныеСведения.Колонки.Добавить("КодНаселенногоПунктаВКоде");
	//АдресныеСведения.Колонки.Добавить("КодУлицыВКоде");
	
	
	ПараметрыОперации.Вставить("ИспользованныеКоды", Новый Соответствие());
	
	АльтернативныеНазвания  = Новый ТаблицаЗначений();
	АльтернативныеНазвания.Колонки.Добавить("Код");
	АльтернативныеНазвания.Колонки.Добавить("Наименование");
	АльтернативныеНазвания.Колонки.Добавить("Сокращение");
	ПараметрыОперации.Вставить("АльтернативныеНазвания", АльтернативныеНазвания);
	
	АдресныеСведения = Новый ТаблицаЗначений();
	АдресныеСведения.Колонки.Добавить("Код");
	АдресныеСведения.Колонки.Добавить("КодРегионаВКоде");
	АдресныеСведения.Колонки.Добавить("Наименование");
	АдресныеСведения.Колонки.Добавить("АльтернативныеНазвания");
	АдресныеСведения.Колонки.Добавить("Сокращение");
	АдресныеСведения.Колонки.Добавить("Индекс");
	АдресныеСведения.Колонки.Добавить("ТипАдресногоЭлемента");
	АдресныеСведения.Колонки.Добавить("КодРайонаВКоде");
	АдресныеСведения.Колонки.Добавить("КодГородаВКоде");
	АдресныеСведения.Колонки.Добавить("КодНаселенногоПунктаВКоде");
	АдресныеСведения.Колонки.Добавить("КодУлицыВКоде");
	ПараметрыОперации.Вставить("АдресныеСведения", АдресныеСведения);	
	
	ПараметрыОперации.Вставить("АдресныеСведенияИБ", Новый Соответствие);
	
КонецПроцедуры	

Процедура ВыполнитьЗагрузкуКлассификатора(ПараметрыОперации) Экспорт 
	
	//Формат2003 			= ПараметрыОперации.Формат2003;
	//КодировкаWindows 	= ПараметрыОперации.КодировкаWindows;
	
	ФайлАдресногоКлассификатора 	= ПолучитьПутьФайлаКлассификатора(ПараметрыОперации.ФайлыКлассификатора.АдресАдресногоКлассификатора);
	ФайлКлассификатораУлиц			= ПолучитьПутьФайлаКлассификатора(ПараметрыОперации.ФайлыКлассификатора.АдресКлассификатораУлиц);
	ФайлКлассификатораДомов  		= ПолучитьПутьФайлаКлассификатора(ПараметрыОперации.ФайлыКлассификатора.АдресКлассификатораДомов);
	ФайлКлассификатораСокращений   	= ПолучитьПутьФайлаКлассификатора(ПараметрыОперации.ФайлыКлассификатора.АдресКлассификатораСокращений);
	
	Для каждого Элемент Из ПараметрыОперации.ИспользуемыеРегионы Цикл
		
		//Дополнительно происходит очистка данных 
		ДополнитьПараметрыЗагрузки(ПараметрыОперации);
		
		ТексЗапроса = 
		"ВЫБРАТЬ
		|	АдресныйКлассификатор.Код,
		|	АдресныйКлассификатор.КодРегионаВКоде,
		|	АдресныйКлассификатор.Наименование,
		|	АдресныйКлассификатор.АльтернативныеНазвания,
		|	АдресныйКлассификатор.Сокращение,
		|	АдресныйКлассификатор.Индекс,
		|	АдресныйКлассификатор.ТипАдресногоЭлемента,
		|	АдресныйКлассификатор.КодРайонаВКоде,
		|	АдресныйКлассификатор.КодГородаВКоде,
		|	АдресныйКлассификатор.КодНаселенногоПунктаВКоде,
		|	АдресныйКлассификатор.КодУлицыВКоде
		|ИЗ
		|	РегистрСведений.АдресныйКлассификатор КАК АдресныйКлассификатор
		|
		|ГДЕ
		|	АдресныйКлассификатор.КодРегионаВКоде = &КодРегионаВКоде";
		
		Запрос = Новый Запрос(ТексЗапроса);
		Запрос.УстановитьПараметр("КодРегионаВКоде", Элемент);
		
		РезультатЗапросаСведений = Запрос.Выполнить();
		МассивСведений = РезультатЗапросаСведений.Выгрузить().ВыгрузитьКолонку("Код");
		//АдресныеСведенияИБ = Новый Соответствие();
		Для Сч = 0 По МассивСведений.ВГраница() Цикл
			//АдресныеСведенияИБ.Вставить(МассивСведений[Сч], Истина);
			ПараметрыОперации.АдресныеСведенияИБ.Вставить(МассивСведений[Сч], Истина);
		КонецЦикла;
		
		ВыражениеДляИндекса = "SUBSTR(CODE,1,2)='" + Формат(Элемент, "ЧЦ=2;ЧВН=") + "'";
		КлассификаторАдресов = Новый XBase(ФайлАдресногоКлассификатора);
		
		Если КлассификаторАдресов.Открыта() Тогда  			
			
			// проверяем структуру адресных полей
			Если (КлассификаторАдресов.поля.Найти("CODE") = Неопределено)
				ИЛИ (КлассификаторАдресов.поля.Найти("NAME") = Неопределено)
				ИЛИ (КлассификаторАдресов.поля.Найти("SOCR") = Неопределено)
				ИЛИ (КлассификаторАдресов.поля.Найти("INDEX") = Неопределено) Тогда
				Сообщить("Классификатор адресов неправильной структуры. Не загружен!", СтатусСообщения.Важное);
				
			Иначе 
				
				КлассификаторАдресов.индексы.Добавить("MAIN","RECNO()", , , ВыражениеДляИндекса);
				КлассификаторАдресов.СоздатьИндексныйФайл(КаталогВременныхФайлов() + "mainkldr.cdx");
				КлассификаторАдресов.ЗакрытьФайл();
				
				КлассификаторАдресов = Новый XBase(ФайлАдресногоКлассификатора, КаталогВременныхФайлов() + "mainkldr.cdx", Истина);
				КлассификаторАдресов.ТекущийИндекс = КлассификаторАдресов.индексы.Найти("MAIN");
				
				УстановитьКодировку(КлассификаторАдресов, ПараметрыОперации.КодировкаWindows);
				
				// если в стурктуре есть необходимые поля - загружаем
				КлассификаторАдресов.Первая();
				
				Если НЕ КлассификаторАдресов.ВКонце() Тогда
					
					ЗагрузитьАдресныйЭлемент(ПараметрыОперации,
												КлассификаторАдресов.CODE,
												КлассификаторАдресов.NAME,
												КлассификаторАдресов.SOCR,
												КлассификаторАдресов.INDEX,
												1000000000000, ?(ПараметрыОперации.Формат2003, 100, 1));
					
					Пока КлассификаторАдресов.Следующая() Цикл
						ЗагрузитьАдресныйЭлемент(ПараметрыОперации,
													КлассификаторАдресов.CODE,
													КлассификаторАдресов.NAME,
													КлассификаторАдресов.SOCR,
													КлассификаторАдресов.INDEX,
													1000000000000, ?(ПараметрыОперации.Формат2003, 100, 1));			
					КонецЦикла;
					
				КонецЕсли;
				
				КлассификаторАдресов.ЗакрытьФайл();
				
			КонецЕсли;
			
		КонецЕсли;
		
		КлассификаторУлиц = Новый XBase(ФайлКлассификатораУлиц);
		
		Если КлассификаторУлиц.Открыта() Тогда
			
			// проверяем структуру адресных полей
			Если (КлассификаторУлиц.поля.Найти("CODE") = Неопределено)
				ИЛИ (КлассификаторУлиц.поля.Найти("NAME") = Неопределено)
				ИЛИ (КлассификаторУлиц.поля.Найти("SOCR") = Неопределено)
				ИЛИ (КлассификаторУлиц.поля.Найти("INDEX") = Неопределено) Тогда
				Сообщить("Классификатор улиц неправильной структуры. Не загружен!", СтатусСообщения.Важное);
				
			Иначе
				
				КлассификаторУлиц.индексы.Добавить("MAIN","RECNO()", , , ВыражениеДляИндекса);
				КлассификаторУлиц.СоздатьИндексныйФайл(КаталогВременныхФайлов() + "mainkldr.cdx");
				КлассификаторУлиц.ЗакрытьФайл();
				
				КлассификаторУлиц = Новый XBase(ФайлКлассификатораУлиц, КаталогВременныхФайлов() + "mainkldr.cdx", Истина);
				КлассификаторУлиц.ТекущийИндекс = КлассификаторУлиц.индексы.Найти("MAIN");
				
				УстановитьКодировку(КлассификаторУлиц, ПараметрыОперации.КодировкаWindows);
				
				// если в стурктуре есть необходимые поля - загружаем
				КлассификаторУлиц.Первая();
				Если НЕ КлассификаторУлиц.ВКонце() Тогда
					ЗагрузитьАдресныйЭлемент(ПараметрыОперации,
												КлассификаторУлиц.CODE,
												КлассификаторУлиц.NAME,
												КлассификаторУлиц.SOCR,
												КлассификаторУлиц.INDEX,
												100000000, ?(ПараметрыОперации.Формат2003, 100, 1));
					
					Пока КлассификаторУлиц.Следующая() Цикл
						
						// проверка на загрузку дома
						КодЭлемента = КлассификаторУлиц.CODE;
						
						ЗагрузитьАдресныйЭлемент(ПараметрыОперации,
													КодЭлемента,
													КлассификаторУлиц.NAME,
													КлассификаторУлиц.SOCR,
													КлассификаторУлиц.INDEX,
													100000000, ?(ПараметрыОперации.Формат2003, 100, 1));
					КонецЦикла;
					
				КонецЕсли;
				
				КлассификаторУлиц.ЗакрытьФайл();
				
			КонецЕсли;
			
		КонецЕсли;
		
		Если ПараметрыОперации.Формат2003 Тогда
			
			КлассификаторДомов = Новый XBase(ФайлКлассификатораДомов);
			
			Если КлассификаторДомов.Открыта() Тогда
				
				// проверяем структуру адресных полей
				Если (КлассификаторДомов.поля.Найти("CODE") = Неопределено)
					ИЛИ (КлассификаторДомов.поля.Найти("NAME") = Неопределено)
					ИЛИ (КлассификаторДомов.поля.Найти("SOCR") = Неопределено)
					ИЛИ (КлассификаторДомов.поля.Найти("KORP") = Неопределено)
					ИЛИ (КлассификаторДомов.поля.Найти("INDEX") = Неопределено) Тогда
					Сообщить("Классификатор домов неправильной структуры. Не загружен!", СтатусСообщения.Важное);
					
				Иначе 
					
					КлассификаторДомов.индексы.Добавить("MAIN","RECNO()", , , ВыражениеДляИндекса);
					КлассификаторДомов.СоздатьИндексныйФайл(КаталогВременныхФайлов() + "mainkldr.cdx");
					КлассификаторДомов.ЗакрытьФайл();
					
					КлассификаторДомов = Новый XBase(ФайлКлассификатораДомов, КаталогВременныхФайлов() + "mainkldr.cdx", Истина);
					КлассификаторДомов.ТекущийИндекс = КлассификаторДомов.индексы.Найти("MAIN");
					
					УстановитьКодировку(КлассификаторДомов, ПараметрыОперации.КодировкаWindows);
					
					КлассификаторДомов.Первая();
					Если НЕ КлассификаторДомов.ВКонце() Тогда
						Дом = КлассификаторДомов.NAME;
						Корпус = КлассификаторДомов.KORP;
						ЗагрузитьАдресныйЭлемент(ПараметрыОперации, 
													КлассификаторДомов.CODE,
													СокрЛП("" + Дом) + ?(ПустаяСтрока(СокрЛП("" + Корпус)), "", "К" + СокрЛП("" + Корпус)),
													КлассификаторДомов.SOCR,
													КлассификаторДомов.INDEX,
													10000);
						
						Пока КлассификаторДомов.Следующая() Цикл
							Дом = КлассификаторДомов.NAME;
							Корпус = КлассификаторДомов.KORP;
							ЗагрузитьАдресныйЭлемент(ПараметрыОперации,
														КлассификаторДомов.CODE,
														СокрЛП("" + Дом) + ?(ПустаяСтрока(СокрЛП("" + Корпус)), "", "К" + СокрЛП("" + Корпус)),
														КлассификаторДомов.SOCR,
														КлассификаторДомов.INDEX,
														10000);
						КонецЦикла;
						
					КонецЕсли;
					
					КлассификаторДомов.ЗакрытьФайл();
					
				КонецЕсли;
				
			КонецЕсли;
		КонецЕсли;
		
		
		ВыборкаЗапроса = РезультатЗапросаСведений.Выбрать();
		Для Сч = 0 По МассивСведений.ВГраница() Цикл
			Если ПараметрыОперации.АдресныеСведенияИБ[МассивСведений[Сч]] = Истина Тогда
				Если ВыборкаЗапроса.НайтиСледующий(МассивСведений[Сч], "Код") Тогда
					ЗаписьАдреса = ПараметрыОперации.АдресныеСведения.Добавить();
					
					ЗаписьАдреса.Код = ВыборкаЗапроса.Код;
					
					ЗаписьАдреса.Наименование              = ВыборкаЗапроса.Наименование;
					ЗаписьАдреса.АльтернативныеНазвания    = ВыборкаЗапроса.АльтернативныеНазвания;
					ЗаписьАдреса.Сокращение                = ВыборкаЗапроса.Сокращение;
					ЗаписьАдреса.Индекс                    = ВыборкаЗапроса.Индекс;
					ЗаписьАдреса.ТипАдресногоЭлемента      = ВыборкаЗапроса.ТипАдресногоЭлемента;
					
					ЗаписьАдреса.КодРегионаВКоде           = ВыборкаЗапроса.КодРегионаВКоде;
					ЗаписьАдреса.КодРайонаВКоде            = ВыборкаЗапроса.КодРайонаВКоде;
					ЗаписьАдреса.КодГородаВКоде            = ВыборкаЗапроса.КодГородаВКоде;
					ЗаписьАдреса.КодНаселенногоПунктаВКоде = ВыборкаЗапроса.КодНаселенногоПунктаВКоде;
					ЗаписьАдреса.КодУлицыВКоде             = ВыборкаЗапроса.КодУлицыВКоде;
					
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
		Для Каждого СтрокаАльтернативногоНазвания Из ПараметрыОперации.АльтернативныеНазвания Цикл
			ЗаписьАдреса = ПараметрыОперации.АдресныеСведения.Найти(Цел(Число(СтрокаАльтернативногоНазвания.Код) / 100) * 100, "Код");
			Если ЗаписьАдреса <> Неопределено Тогда
				ЗаписьАдреса.АльтернативныеНазвания = ЗаписьАдреса.АльтернативныеНазвания + СтрокаАльтернативногоНазвания.Наименование + " " + СтрокаАльтернативногоНазвания.Сокращение + ",";
			КонецЕсли;
		КонецЦикла;
		
		// очищаем регион
		НаборАдресныхСведений = РегистрыСведений.АдресныйКлассификатор.СоздатьНаборЗаписей();
		НаборАдресныхСведений.Отбор.КодРегионаВКоде.Использование = Истина;
		НаборАдресныхСведений.Отбор.КодРегионаВКоде.Значение = Элемент;
		НаборАдресныхСведений.Записать(Истина);
		
		// заносим новые данные порциями
		СчетчикЗаписей = 0;
		
		Для каждого АдреснаяЗапись из ПараметрыОперации.АдресныеСведения Цикл
			Если СчетчикЗаписей = 0 Тогда
				НаборАдресныхСведений = РегистрыСведений.АдресныйКлассификатор.СоздатьНаборЗаписей();
				НаборАдресныхСведений.Отбор.КодРегионаВКоде.Использование = Истина;
				НаборАдресныхСведений.Отбор.КодРегионаВКоде.Значение = Элемент;
			КонецЕсли;
			
			ЗаписьАдреса = НаборАдресныхСведений.Добавить();
			
			ЗаписьАдреса.Код = АдреснаяЗапись.Код;
			
			ЗаписьАдреса.Наименование              = АдреснаяЗапись.Наименование;
			ЗаписьАдреса.АльтернативныеНазвания    = АдреснаяЗапись.АльтернативныеНазвания;
			ЗаписьАдреса.Сокращение                = АдреснаяЗапись.Сокращение;
			ЗаписьАдреса.Индекс                    = АдреснаяЗапись.Индекс;
			ЗаписьАдреса.ТипАдресногоЭлемента      = АдреснаяЗапись.ТипАдресногоЭлемента;
			
			ЗаписьАдреса.КодРегионаВКоде           = АдреснаяЗапись.КодРегионаВКоде;
			ЗаписьАдреса.КодРайонаВКоде            = АдреснаяЗапись.КодРайонаВКоде;
			ЗаписьАдреса.КодГородаВКоде            = АдреснаяЗапись.КодГородаВКоде;
			ЗаписьАдреса.КодНаселенногоПунктаВКоде = АдреснаяЗапись.КодНаселенногоПунктаВКоде;
			ЗаписьАдреса.КодУлицыВКоде             = АдреснаяЗапись.КодУлицыВКоде;
			
			Если СчетчикЗаписей >= 170 Тогда
				НаборАдресныхСведений.Записать(Ложь);
				СчетчикЗаписей = 0;
			Иначе
				СчетчикЗаписей = СчетчикЗаписей + 1;
			КонецЕсли;
			
		КонецЦикла;
		
		Если СчетчикЗаписей > 0 Тогда
			НаборАдресныхСведений.Записать(Ложь);
		КонецЕсли;        			              
		
	КонецЦикла;
	
	КлассификаторСокращений = Новый XBase(ФайлКлассификатораСокращений,,Истина);
	
	Если КлассификаторСокращений.Открыта() Тогда
		
		УстановитьКодировку(КлассификаторСокращений, ПараметрыОперации.КодировкаWindows);
		
		СправочникКлассификатора = Справочники.АдресныеСокращения;
		
		// проверяем структуру адресных полей
		Если (КлассификаторСокращений.поля.Найти("KOD_T_ST") = Неопределено)
			ИЛИ (КлассификаторСокращений.поля.Найти("SOCRNAME") = Неопределено)
			ИЛИ (КлассификаторСокращений.поля.Найти("SCNAME") = Неопределено)
			ИЛИ (КлассификаторСокращений.поля.Найти("LEVEL") = Неопределено) Тогда
			Сообщить("Классификатор сокращений неправильной структуры. Не загружен!", СтатусСообщения.Важное);
			
		Иначе
			// если в структуре есть необходимые поля - загружаем
			КлассификаторСокращений.Первая();
			Если НЕ КлассификаторСокращений.ВКонце() Тогда
				
				Фасет = Число(СокрЛП(КлассификаторСокращений.KOD_T_ST));
				ОбъектАдреса = СправочникКлассификатора.НайтиПоКоду(Фасет);
				Если ОбщегоНазначения.ЗначениеНеЗаполнено(ОбъектАдреса) Тогда
					ОбъектАдреса = СправочникКлассификатора.СоздатьЭлемент();
					ОбъектАдреса.Код = Фасет;
				Иначе
					ОбъектАдреса = ОбъектАдреса.ПолучитьОбъект()
				КонецЕсли;
				
				ОбъектАдреса.Наименование = СокрЛП(КлассификаторСокращений.SOCRNAME);
				ОбъектАдреса.Сокращение = СокрЛП(КлассификаторСокращений.SCNAME);
				ОбъектАдреса.Уровень = Число(КлассификаторСокращений.LEVEL);
				
				ОбъектАдреса.Записать();
				
				Пока КлассификаторСокращений.Следующая() Цикл
					
					Фасет = Число(СокрЛП(КлассификаторСокращений.KOD_T_ST));
					ОбъектАдреса = СправочникКлассификатора.НайтиПоКоду(Фасет);
					Если ОбщегоНазначения.ЗначениеНеЗаполнено(ОбъектАдреса) Тогда
						ОбъектАдреса = СправочникКлассификатора.СоздатьЭлемент();
						ОбъектАдреса.Код = Фасет;
					Иначе
						ОбъектАдреса = ОбъектАдреса.ПолучитьОбъект()
					КонецЕсли;
					
					ОбъектАдреса.Наименование = СокрЛП(КлассификаторСокращений.SOCRNAME);
					ОбъектАдреса.Сокращение = СокрЛП(КлассификаторСокращений.SCNAME);
					ОбъектАдреса.Уровень = Число(КлассификаторСокращений.LEVEL);
					
					ОбъектАдреса.Записать();
					
				КонецЦикла;
				
			КонецЕсли;
			
			КлассификаторСокращений.ЗакрытьФайл();
			
		КонецЕсли;
		
	КонецЕсли; 
	
КонецПроцедуры	

// Процедура загружает в справочник адресный классификатор один адресный 
// элемент по переданным параметрам.
//
// Параметры:
//  КодЭлемента - значение кода для адресного элемента.
//  Наименование - значение наименования для адресного элемента.
//  Сокращение - значение сокращения для адресного элемента.
//  Индекс - значение индекса для адресного элемента.
//  МножительСдвига - множитель для окончательного сдвига кода ( см. вычисление выражения).
//  ДелительСдвига - делитель для первичного сдвига кода ( см. вычисление выражения).
//
Процедура ЗагрузитьАдресныйЭлемент(ПараметрыОперации, Знач КодЭлемента, Знач Наименование, Знач Сокращение, Знач Индекс, Знач МножительСдвига, Знач ДелительСдвига = 1)
	
	Если СокрЛП(Строка(КодЭлемента)) = "" Тогда
		Возврат;
	КонецЕсли;
	
	Если СокрЛП(Строка(Наименование)) = "" Тогда
		Возврат;
	КонецЕсли;
	
	Если СокрЛП(Строка(Сокращение)) = "" Тогда
		Возврат;
	КонецЕсли;
	
	Наименование = СокрЛП(Наименование);
	Сокращение   = СокрЛП(Сокращение);
	
	Если (ПараметрыОперации.Формат2003) И (СтрДлина(КодЭлемента) < 19) Тогда
		Если Прав(КодЭлемента, 2) <> "00" Тогда
			СтрокаАльтернативныхНазваний = ПараметрыОперации.АльтернативныеНазвания.Добавить();
			КодЭлемента  = Число(СтрЗаменить(КодЭлемента, " ", "0"));
			СтрокаАльтернативныхНазваний.Код = Цел(КодЭлемента / ДелительСдвига) * МножительСдвига * 100 + КодЭлемента%ДелительСдвига;
			СтрокаАльтернативныхНазваний.Наименование = Наименование;
			СтрокаАльтернативныхНазваний.Сокращение = Сокращение;
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	КодЭлемента  = Число(СтрЗаменить(КодЭлемента, " ", "0"));
	КодЭлемента = Цел(КодЭлемента / ДелительСдвига) * МножительСдвига * 100 + КодЭлемента%ДелительСдвига;
	
	КодРегиона = Цел(КодЭлемента / КонтактнаяИнформация.МаскаРегиона());
	
	КодРайона            = Цел(КодЭлемента / КонтактнаяИнформация.МаскаРайона()) % 1000;
	КодГорода            = Цел(КодЭлемента / КонтактнаяИнформация.МаскаГорода()) % 1000;
	КодНаселенногоПункта = Цел(КодЭлемента / КонтактнаяИнформация.МаскаНасПункта()) % 1000;
	КодУлицы             = Цел(КодЭлемента / КонтактнаяИнформация.МаскаУлицы())% 10000;
	
	Если ОбщегоНазначения.ЗначениеНеЗаполнено(Индекс) Тогда
		Индекс = "";
	Иначе
		Индекс = СтрЗаменить(Формат(Число(Индекс),"ЧЦ=6,ЧВН="), " " ,"");
		Индекс = СтрЗаменить(Индекс, Символ(160) ,"");
	КонецЕсли;
	
	
	Если (Врег(Сокращение) = "ДОМ") И (Цел(КодЭлемента / КонтактнаяИнформация.МаскаДома())% 10000 = 0) Тогда
		// дом с нулевым кодом дома - когда загружаем классификатор улиц формата 2002 года
		ТексЗапросаПоискДома = 
		"ВЫБРАТЬ
		|	АдресныйКлассификатор.Код
		|ИЗ
		|	РегистрСведений.АдресныйКлассификатор КАК АдресныйКлассификатор
		|
		|ГДЕ
		|	АдресныйКлассификатор.КодРегионаВКоде = &КодРегионаВКоде И
		|	АдресныйКлассификатор.КодРайонаВКоде = &КодРайонаВКоде И
		|	АдресныйКлассификатор.КодГородаВКоде = &КодГородаВКоде И
		|	АдресныйКлассификатор.КодНаселенногоПунктаВКоде = &КодНаселенногоПунктаВКоде И
		|	АдресныйКлассификатор.КодУлицыВКоде = &КодУлицыВКоде И
		|	АдресныйКлассификатор.Наименование = &Наименование И
		|	АдресныйКлассификатор.ТипАдресногоЭлемента = 6";
		
		ЗапросПоискДома = Новый Запрос(ТексЗапросаПоискДома);
		
		ЗапросПоискДома.УстановитьПараметр("КодРегионаВКоде", КодРегиона);
		ЗапросПоискДома.УстановитьПараметр("КодРайонаВКоде", КодРайона);
		ЗапросПоискДома.УстановитьПараметр("КодГородаВКоде", КодГорода);
		ЗапросПоискДома.УстановитьПараметр("КодНаселенногоПунктаВКоде", КодНаселенногоПункта);
		ЗапросПоискДома.УстановитьПараметр("КодУлицыВКоде", КодУлицы);
		ЗапросПоискДома.УстановитьПараметр("Наименование", Наименование);
		
		Выборка = ЗапросПоискДома.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда
			Возврат;
		КонецЕсли;
		
		ДобавилиДом = Ложь;
		
		Для Сч = 1 По 999 Цикл
			КодДома = КодРегиона * КонтактнаяИнформация.МаскаРегиона()
			+ КодРайона * КонтактнаяИнформация.МаскаРайона()
			+ КодГорода * КонтактнаяИнформация.МаскаГорода()
			+ КодНаселенногоПункта * КонтактнаяИнформация.МаскаНасПункта()
			+ КодУлицы * КонтактнаяИнформация.МаскаУлицы()
			+ Сч * КонтактнаяИнформация.МаскаДома();
			
			Если ПараметрыОперации.АдресныеСведенияИБ[КодДома] = Истина Тогда
				Продолжить;
			КонецЕсли;                        
			
			Если ПараметрыОперации.ИспользованныеКоды[КодДома] = Истина Тогда  // и уже в добавленных записях
				Продолжить;
			КонецЕсли;
			
			ДобавилиДом = Истина;
			КодЭлемента = КодДома;
			Прервать;
			
		КонецЦикла;
		
		Если НЕ ДобавилиДом Тогда
			Сообщить("Не удалось добавить адресный элемент """ + КодЭлемента + "   " + Наименование + "   " + Сокращение, СтатусСообщения.Важное);
			Возврат;
		КонецЕсли;
		
	КонецЕсли;
	
	Если ПараметрыОперации.ИспользованныеКоды[КодЭлемента] = Истина Тогда  //уже добавили элемент с таким кодом
		Сообщить("Не удалось добавить адресную информацию о """ + Наименование + " " + Сокращение + " (" + КодЭлемента + ")""", СтатусСообщения.Внимание);
		Возврат;
	КонецЕсли;
	
	ПараметрыОперации.ИспользованныеКоды.Вставить(КодЭлемента, Истина);
	
	ЗаписьАдреса = ПараметрыОперации.АдресныеСведения.Добавить();
	ЗаписьАдреса.Код = КодЭлемента;
	
	ЗаписьАдреса.Наименование = Наименование;
	ЗаписьАдреса.АльтернативныеНазвания = "";
	ЗаписьАдреса.Сокращение = Сокращение;
	ЗаписьАдреса.Индекс = Индекс;
	ЗаписьАдреса.ТипАдресногоЭлемента = КонтактнаяИнформация.ПолучитьТипАдресногоЭлемента(КодЭлемента);
	
	ЗаписьАдреса.КодРегионаВКоде           = КодРегиона;
	ЗаписьАдреса.КодРайонаВКоде            = КодРайона;
	ЗаписьАдреса.КодГородаВКоде            = КодГорода;
	ЗаписьАдреса.КодНаселенногоПунктаВКоде = КодНаселенногоПункта;
	ЗаписьАдреса.КодУлицыВКоде             = КодУлицы;
	
	Если ПараметрыОперации.АдресныеСведенияИБ[КодЭлемента] = Истина Тогда
		ПараметрыОперации.АдресныеСведенияИБ[КодЭлемента] = Ложь;
	КонецЕсли;
	
КонецПроцедуры
